programming/php/php_practice.html
---
title: "PHP Practice"
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>PHP Practice</title>
<!-- 2016-10-22 周六 10:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />

<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>





</head>
<body>
<div id="content">
<h1 class="title">PHP Practice</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. PSR</a>
<ul>
<li><a href="#sec-1-1">1.1. PSR-1</a></li>
<li><a href="#sec-1-2">1.2. PSR-2</a></li>
<li><a href="#sec-1-3">1.3. PSR-3</a></li>
<li><a href="#sec-1-4">1.4. PSR-4</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 项目结构</a></li>
<li><a href="#sec-3">3. Front Controller</a></li>
<li><a href="#sec-4">4. 资源</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> PSR</h2>
<div class="outline-text-2" id="text-1">
<p>
PSR
</p>
<ul class="org-ul">
<li>PHP Standards Recommendation
</li>
<li>PSR-1: Basic code style
</li>
<li>PSR-2: Strict code style
</li>
<li>PSR-3: Logger interface
</li>
<li>PSR-4: Autoloading
</li>
</ul>

<p>
Tools
</p>
<ul class="org-ul">
<li><a href="https://github.com/squizlabs/PHP_CodeSniffer">PHP Code Sniffer (phpcs)</a>
</li>
<li><a href="https://github.com/FriendsOfPHP/PHP-CS-Fixer">PHP-CS-Fixer</a>
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> PSR-1</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">PHP tags</th>
<th scope="col" class="left"><code>&lt;?php ?&gt;</code> or <code>&lt;?= ?&gt;</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Encoding</td>
<td class="left">UTF-8 without a byte order mark (BOM)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Objective</td>
<td class="left">a single file can do one, but not both of</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">- define symbols, eg. class, trait, function, constant</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">- perform an action that has side effects, eg. create output, manipulate data</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Autoloading</td>
<td class="left">namespaces and classes must support the PSR-4 autoloader standard</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Class names</td>
<td class="left">CamelCase</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Method names</td>
<td class="left">camelCase</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Constant names</td>
<td class="left">all uppercase characters, may use underscores</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> PSR-2</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Indentation</th>
<th scope="col" class="left">4 space characters</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Lines</td>
<td class="left">- not exceed 120 characters (not exceed 80 recommended)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">- use Unix linefeed (LF) endings</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">- not have trailing white space</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Files</td>
<td class="left">- not include a trailing <code>?&gt;</code> (to avoid unexpected output errors)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">- end with a single blank line</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Keywords</td>
<td class="left">use only lowercase characters, eg. <code>true</code>, <code>false</code>, <code>null</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Namespaces</td>
<td class="left">- declaration is followed by one blank line</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">- import or alias is followed by one blank line</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Classes</td>
<td class="left">- <code>{</code> and <code>}</code> reside on a new line</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">- <code>extends</code> and <code>implements</code> appear on the same line as the class name</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Methods</td>
<td class="left">- <code>{</code> and <code>}</code> reside on a new line</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">- <code>(</code> does not have a trailing space</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">- <code>)</code> does not have a preceding space</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">- each method argument (except the last) is followed by =,= and one space</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Visibility</td>
<td class="left">- declare a visibility for each class property and method</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">- <code>abstract</code> and <code>final</code> appear before the visibility</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">- <code>static</code> appears after the visibility</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Control structures</td>
<td class="left">- keywords are followed by a single space</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">- <code>{</code> remains on the same line as the keyword</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">- <code>}</code> resides on a new line</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">- <code>(</code> does not have a trailing space</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">- <code>)</code> does not have a preceding space</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> PSR-3</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Logger component
</p>
<ul class="org-ul">
<li>must include a class that implements the interface <code>Psr\Log\LoggerInterface</code>
</li>
<li><a href="https://github.com/Seldaek/monolog">monolog/monolog</a>
</li>
</ul>

<p>
PSR-3 interface
</p>
<ul class="org-ul">
<li>replicates the RFC 5424 syslog protocol
</li>
<li>each interface method maps to a RFC 5424 protocol level
</li>
<li><code>$message</code> must be
<ul class="org-ul">
<li>a string
</li>
<li>an object with a <code>__toString()</code> method
</li>
</ul>
</li>
<li><code>$context</code>
<ul class="org-ul">
<li>an associative array
</li>
<li>keys are placeholder names
</li>
<li>values replace <code>{placeholder_name}</code> in <code>$message</code>
</li>
</ul>
</li>
</ul>

<p>
PSR-3 interface
</p>
<div class="org-src-container">

<pre class="src src-php"><span class="org-preprocessor">&lt;?php</span>
<span class="org-keyword">namespace</span> <span class="org-type">Psr\Log</span>;

<span class="org-keyword">interface</span> <span class="org-type">LoggerInterface</span>
{
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">emergency</span>($<span class="org-variable-name">message</span>, <span class="org-type">array</span> $<span class="org-variable-name">context</span> = <span class="org-function-name">array</span>());
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">alert</span>($<span class="org-variable-name">message</span>, <span class="org-type">array</span> $<span class="org-variable-name">context</span> = <span class="org-function-name">array</span>());
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">critical</span>($<span class="org-variable-name">message</span>, <span class="org-type">array</span> $<span class="org-variable-name">context</span> = <span class="org-function-name">array</span>());
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">error</span>($<span class="org-variable-name">message</span>, <span class="org-type">array</span> $<span class="org-variable-name">context</span> = <span class="org-function-name">array</span>());
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">warning</span>($<span class="org-variable-name">message</span>, <span class="org-type">array</span> $<span class="org-variable-name">context</span> = <span class="org-function-name">array</span>());
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">notice</span>($<span class="org-variable-name">message</span>, <span class="org-type">array</span> $<span class="org-variable-name">context</span> = <span class="org-function-name">array</span>());
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">info</span>($<span class="org-variable-name">message</span>, <span class="org-type">array</span> $<span class="org-variable-name">context</span> = <span class="org-function-name">array</span>());
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">debug</span>($<span class="org-variable-name">message</span>, <span class="org-type">array</span> $<span class="org-variable-name">context</span> = <span class="org-function-name">array</span>());
    <span class="org-keyword">public</span> <span class="org-keyword">function</span> <span class="org-function-name">log</span>($<span class="org-variable-name">level</span>, $<span class="org-variable-name">message</span>, <span class="org-type">array</span> $<span class="org-variable-name">context</span> = <span class="org-function-name">array</span>());
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> PSR-4</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Autoloader
</p>
<ul class="org-ul">
<li>a strategy for
<ul class="org-ul">
<li>finding a class, interface, or trait
</li>
<li>loading it into interpreter on-demand at runtime
</li>
</ul>
</li>
</ul>

<p>
Without autoloader
</p>
<ul class="org-ul">
<li>explicitly include files with <code>include</code> or <code>require</code>
</li>
</ul>

<p>
PSR-4
</p>
<ul class="org-ul">
<li>enables autoloading all components with only one autoloader
</li>
<li>suggests how code is organized into filesystem directories and namespaces
</li>
<li>map a namespace prefix to a filesystem directory
</li>
</ul>

<p>
Without PSR-4
</p>
<ul class="org-ul">
<li>use <code>__autoload()</code> and <code>spl_autoload_register()</code> to register custom autoloaders
</li>
<li>register unique autoloaders for every component
</li>
</ul>

<p>
PSR-4 autoloader example
</p>
<div class="org-src-container">

<pre class="src src-php"><span class="org-preprocessor">&lt;?php</span>
<span class="org-comment-delimiter">/**</span>
<span class="org-comment"> * An example of a project-specific implementation.</span>
<span class="org-comment"> *</span>
<span class="org-comment"> * After registering this autoload function with SPL, the following line</span>
<span class="org-comment"> * would cause the function to attempt to load the \Foo\Bar\Baz\Qux class</span>
<span class="org-comment"> * from /path/to/project/src/Baz/Qux.php:</span>
<span class="org-comment"> *</span>
<span class="org-comment"> * new \Foo\Bar\Baz\Qux;</span>
<span class="org-comment"> *</span>
<span class="org-comment"> * @param string $class The fully qualified class name.</span>
<span class="org-comment"> * @return void</span>
<span class="org-comment"> </span><span class="org-comment-delimiter">*/</span>
<span class="org-function-name">spl_autoload_register</span>(<span class="org-keyword">function</span> ($<span class="org-variable-name">class</span>) {
    <span class="org-comment-delimiter">// </span><span class="org-comment">project-specific namespace prefix</span>
    $<span class="org-variable-name">prefix</span> = <span class="org-string">'Foo\\Bar\\'</span>;

    <span class="org-comment-delimiter">// </span><span class="org-comment">base directory for the namespace prefix</span>
    $<span class="org-variable-name">base_dir</span> = <span class="org-constant">__DIR__</span> . <span class="org-string">'/src/'</span>;

    <span class="org-comment-delimiter">// </span><span class="org-comment">does the class use the namespace prefix?</span>
    $<span class="org-variable-name">len</span> = <span class="org-function-name">strlen</span>($<span class="org-variable-name">prefix</span>);
    <span class="org-keyword">if</span> (<span class="org-function-name">strncmp</span>($<span class="org-variable-name">prefix</span>, $<span class="org-variable-name">class</span>, $<span class="org-variable-name">len</span>) !== <span class="org-default">0</span>) {
        <span class="org-comment-delimiter">// </span><span class="org-comment">no, move to the next registered autoloader</span>
        <span class="org-keyword">return</span>;
    }

    <span class="org-comment-delimiter">// </span><span class="org-comment">get the relative class name</span>
    $<span class="org-variable-name">relative_class</span> = <span class="org-function-name">substr</span>($<span class="org-variable-name">class</span>, $<span class="org-variable-name">len</span>);

    <span class="org-comment-delimiter">// </span><span class="org-comment">replace the namespace prefix with the base directory, replace namespace</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">separators with directory separators in the relative class name, append</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">with .php</span>
    $<span class="org-variable-name">file</span> = $<span class="org-variable-name">base_dir</span> . <span class="org-function-name">str_replace</span>(<span class="org-string">'\\'</span>, <span class="org-string">'/'</span>, $<span class="org-variable-name">relative_class</span>) . <span class="org-string">'.php'</span>;

    <span class="org-comment-delimiter">// </span><span class="org-comment">if the file exists, require it</span>
    <span class="org-keyword">if</span> (<span class="org-function-name">file_exists</span>($<span class="org-variable-name">file</span>)) {
        <span class="org-keyword">require</span> $<span class="org-variable-name">file</span>;
    }
});
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 项目结构</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-sh">application/     <span class="org-comment-delimiter"># </span><span class="org-comment">Application specific code</span>
    controllers/
    models/
    views/
config/
db/              <span class="org-comment-delimiter"># </span><span class="org-comment">Database backup</span>
library/         <span class="org-comment-delimiter"># </span><span class="org-comment">Framework code</span>
public/          <span class="org-comment-delimiter"># </span><span class="org-comment">Publicly accessible content</span>
    css/
    img/
    js/
scripts/         <span class="org-comment-delimiter"># </span><span class="org-comment">CMD utilities</span>
tmp/
    cache/
    logs/
    sessions/
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Front Controller</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>a single entry point (<code>index.php</code>)
</li>
<li>all requests (except css/js/image) are forwarded to
</li>
<li>enables usage of SEO-friendly URLs
</li>
<li>responsible for routing the request and dispatching the appropriate code
</li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><code>.htaccess</code></label>
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Redirect calls to public/</span>
&lt;IfModule mod_rewrite.c&gt;
    RewriteEngine on
    RewriteRule    ^$   public/   [L]
    RewriteRule    (.*) public/$<span class="org-variable-name">1</span> [L]
&lt;/IfModule&gt;

<span class="org-comment-delimiter"># </span><span class="org-comment">Redirect calls to public/index.php</span>
&lt;IfModule mod_rewrite.c&gt;
    RewriteEngine On
    <span class="org-comment-delimiter"># </span><span class="org-comment">Redirect calls when the path is not file or directory</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">Redirect to index.php?url=PATHNAME</span>
    RewriteCond %{REQUEST_FILENAME} !-f
    RewriteCond %{REQUEST_FILENAME} !-d
    RewriteRule ^(.*)$ index.php?<span class="org-variable-name">url</span>=$<span class="org-variable-name">1</span> [PT,L]
&lt;/IfModule&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 资源</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="http://www.php-fig.org/psr/">PHP Standards Recommendations</a>
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2016-10-22 周六 10:47</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
